app/Models/CrudModel.php

INSERT INTO `solicitud` (`id_funcionario`, `funcionario`, `id_entidad`, `entidad`, `id_oficina`, `oficina`, `dependencia`, `id_clasificacion`, `id_categoria`, `descripcion_problema`, `id_prioridad`, `id_estado`, `respuesta`, `imagen01`) VALUES ('1 ', 'd', '1', '2', '1', 'd', 'd', 'hardware', '', '', 'alta', 'activo', 'Sin respuesta', 'Sin imagen')
---
		public function insertarDatos($datos) {
			$Nombres = $this->db->table('solicitud');
			$Nombres->insert($datos);

INSERT INTO `archivos` (`carpeta`, `nombre`, `tipo`, `tamaño`, `descripcion`, `ubicacion`) VALUES ('1', 'cs', 'application/vnd.openxmlformats-officedocument.wordprocessingml.document', 1950635, 'sc', '1696651149_785511f21e6aaa0a662d.docx')
---
		public function insertarArchivos($datos) {
			$Nombres = $this->db->table('archivos');
			$Nombres->insert($datos);